print("დავალება 4")

# დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს და აბრუნებს სტრიქონის UTF-8 დაშიფრულ ვერსიას.

st = input("Enter a string: ")
st1 = st.encode()

print(st1)

# დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს.ჩამოაშორეთ ზედმეტი ინტერვალები.ყველა სიმბოლო გადაიყვანეთ პატარა ასოებში დადაუმატეთ ქვესტრიქონი 'Python'.თუ შეყვანილ სტრიქონში არსებობს სიტყვა "python", ჩაანაცვლეთ "Python"-ით.

st = " pyThon Is Funny"
print(st.strip())
print(st.lower())

text = 'python ' + st[1:]

print(text.replace('python', 'Python'))


# დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს.პროგრამამ უნდა დააბრუნოს ახალი სტრიქონი,რომელიც შედგება შეყვანილი სტრიქონის პირველი ნახევრისაგან.

user_inf = input("შეიყვანეთ სტრიქონი")
st = user_inf
half = len(st) // 2
print(st[:half])

# დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს.string მოდულის გამოყენებით დაწერეთ შემოწმება.სტრიქონი ვალიდურია მაშინ, როდესაც ის შეიცავს მინიმუმ ერთ ლათინურ ასოსა დამინიმუმ ერთ ციფრს და ამავე დროს არ შეიცავს დამატებით სიმბოლოებს: '!', '~', '#', '$' და ა.შ.

st = "MariamGigaur2223"
alpha = st.isalpha()
digit = st.isdigit()
alnum = st.isalnum()

if alpha is False and digit is False and alnum is True:
    print("Yes")
else:
     print("No")


#დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს,სტრიქონი გადაყავს ბაიტებში, ბეჭდავს მნიშვნელობას და შემდეგ კიგადაყავს ბაიტებიდან სტრიქონში და ბეჭდავს სტრიქონს.

text = input("შეიყვანეთ ტექსტი")
byte = text.encode()
print(byte)

st = byte.decode()
print(st)

